__author__ = 'Куркин Иван'

# Во втором массиве сохранить индексы четных элементов первого массива. Например, если дан массив
# со значениями 8, 3, 15, 6, 4, 2, второй массив надо заполнить значениями 0, 3, 4, 5, (индексация начинается с нуля),
# т.к. именно в этих позициях первого массива стоят четные числа.


import random

SIZE = 10
MIN_ITEM = 0
MAX_ITEM = 100

lst1 = [random.randint(MIN_ITEM, MAX_ITEM) for i in range(SIZE)]
lst2 = []

for i in range(len(lst1)):
    if lst1[i] % 2 == 0:
        lst2.append(i)

print("Дан список:", lst1)
print("Список индексов четных чисел данного списка", lst2)
