__author__ = 'Куркин Иван'

# 1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
# Числа и знак операции вводятся пользователем. После выполнения вычисления программа не завершается,
# а запрашивает новые данные для вычислений. Завершение программы должно выполняться при вводе символа '0'
# в качестве знака операции. Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),
# программа должна сообщать об ошибке и снова запрашивать знак операции.
# Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел его в качестве делителя.

while True:
    a = int(input("Введите первое число: "))
    b = int(input("Введите второе число: "))
    znak = input("Введите знак операции -+*/ или 0 для выхода: ")

    if znak == "+":
        print(a+b)
    elif znak == "-":
        print(a-b)
    elif znak == "*":
        print(a*b)
    elif znak == '/':
        if b == 0:
            print("Деление на ноль запрещено")
            continue
        print(a/b)
    elif znak == '0':
        print("Конец")
        break
    else:
        print("Ошибка, необходимо ввести -+*/ или 0")
