__author__ = 'Куркин Иван'

# Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,… Количество элементов (n) вводится с клавиатуры.

n = int(input('Введите кол-во элементов ряда чисел: 1, -0.5, 0.25, -0.125, ... : '))
summa = 0
element = 1
for i in range(n):
    summa += element
    element /= (-2)
print(summa)