__author__ = 'Куркин Иван'
# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

# Сделал при помощи встроенного алфавита модуля string
import string

a = int(input('Введите номер строчной буквы латинского алфавита: '))
alphabet = string.ascii_letters

print('Это буква -', alphabet[a-1])


# Сделал при помощи встр. команд
a1 = input('Введите номер строчной буквы латинского алфавита: ')

letter = chr(int(a1) + ord('a') - 1)

print(f'Буква по введенному номеру: {letter}')