__author__ = 'Куркин Иван'
# Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.

print('Введите две строчные буквы латинского алфавита')
a = input('Первая буква: ')
b = input('Вторая буква: ')

pos_a = ord(a) - ord('a') + 1
pos_b = ord(b) - ord('a') + 1

count = abs(pos_a - pos_b) - 1

print(f'Порядковый номер первой буквы - {pos_a}')
print(f'Порядковый номер второй буквы - {pos_b}')
print(f'Расстояние между этими буквами - {count}')
